# PYTHON BASIC STATS CASE STUDY

### IMPORTING LIBRARIES

In [1]:
import numpy as np
import pandas as pd
import scipy.stats as stats

In [2]:
path = 'C:/Users/shubh/Desktop/ALABS PYTHON CASE STUDIES/FOUNDATION/7. Basic Stats - Case Study-1/7. Basic Stats - Case Study-1/'

## Q1.
A physician is evaluating a new diet for her patients with a family history of heart disease. To test the effectiveness of this diet, 16 patients are placed on the diet for 6 months. Their weights and triglyceride levels are measured before and after the study, and the physician wants to know if either set of measurements has changed.(dietstudy.csv)

In [3]:
diet_study = pd.read_csv(path + 'dietstudy.csv')
diet_study.head()

   patid  age  gender  tg0  tg1  tg2  tg3  tg4  wgt0  wgt1  wgt2  wgt3  wgt4
0      1   45    Male  180  148  106  113  100   198   196   193   188   192
1      2   56    Male  139   94  119   75   92   237   233   232   228   225
2      3   50    Male  152  185   86  149  118   233   231   229   228   226
3      4   46  Female  112  145  136  149   82   179   181   177   174   172
4      5   64    Male  156  104  157   79   97   219   217   215   213   214

In [4]:
tg0_mean, tg1_mean, tg2_mean, tg3_mean, tg4_mean = diet_study['tg0'].mean(), diet_study['tg1'].mean(), diet_study['tg2'].mean(), diet_study['tg3'].mean(), diet_study['tg4'].mean()
print('Mean of tg0 :', tg0_mean, '| Mean of tg1 :', tg1_mean, '| Mean of tg2 :', tg2_mean, '| Mean of tg3 :', tg3_mean, '| Mean of tg4 :', tg4_mean)

Mean of tg0 : 138.4375 | Mean of tg1 : 124.5625 | Mean of tg2 : 124.375 | Mean of tg3 : 118.8125 | Mean of tg4 : 124.375

In [5]:
wgt0_mean, wgt1_mean, wgt2_mean, wgt3_mean, wgt4_mean = diet_study['wgt0'].mean(), diet_study['wgt1'].mean(), diet_study['wgt2'].mean(), diet_study['wgt3'].mean(), diet_study['wgt4'].mean()
print('Mean of wgt0 :', wgt0_mean, '| Mean of wgt1 :', wgt1_mean, '| Mean of wgt2 :', wgt2_mean, '| Mean of wgt3 :', wgt3_mean, '| Mean of wgt4 :', wgt4_mean)

Mean of wgt0 : 198.375 | Mean of wgt1 : 196.125 | Mean of wgt2 : 194.125 | Mean of wgt3 : 192.125 | Mean of wgt4 : 190.3125

### Ho : Mean of measures before study = Mean of measures after study (Base Case Scenario)
### Ha : Mean of measures before study != Mean of measures after study (Scenario we wish to be true)
### CI : 95%, p-value : 0.05
### Paired Sample t-test

In [6]:
print(stats.ttest_rel(diet_study.tg0, diet_study.tg1))
print(stats.ttest_rel(diet_study.tg0, diet_study.tg2))
print(stats.ttest_rel(diet_study.tg0, diet_study.tg3))
print(stats.ttest_rel(diet_study.tg0, diet_study.tg4))

Ttest_relResult(statistic=1.708339375326079, pvalue=0.10817790329711016)
Ttest_relResult(statistic=1.4652897466766746, pvalue=0.16348782284970503)
Ttest_relResult(statistic=1.6460302971284584, pvalue=0.12054358887600601)
Ttest_relResult(statistic=1.2000008533342437, pvalue=0.24874946576903698)

In [7]:
print(stats.ttest_rel(diet_study.wgt0, diet_study.wgt1))
print(stats.ttest_rel(diet_study.wgt0, diet_study.wgt2))
print(stats.ttest_rel(diet_study.wgt0, diet_study.wgt3))
print(stats.ttest_rel(diet_study.wgt0, diet_study.wgt4))

Ttest_relResult(statistic=3.69481872265182, pvalue=0.0021619105203089487)
Ttest_relResult(statistic=9.405816697932298, pvalue=1.1117975587210374e-07)
Ttest_relResult(statistic=10.2633853406995, pvalue=3.545567049017907e-08)
Ttest_relResult(statistic=11.174521688532522, pvalue=1.137689414996614e-08)

### Conclusion :
Since the p-value for triglyceride levels before and after the diet plan is coming out to be high(>0.05), we can say that the triglyceride levels of patients post diet have not shown any significant change.

Since the p-value for weight before and after the diet plan is coming out to be low(<0.05), we can say that the weight of the patients post diet plan have shown significant decline.

## Q2.
An analyst at a department store wants to evaluate a recent credit card promotion. To this end, 500 cardholders were randomly selected. Half received an ad promoting a reduced interest rate on purchases made over the next three months, and half received a standard seasonal ad. Is the promotion effective to increase sales?(creditpromo.csv)

In [8]:
credit_promo = pd.read_csv(path + 'creditpromo.csv')
credit_promo.head()

     id         insert      dollars
0   148       Standard  2232.771979
1   572  New Promotion  1403.807542
2   973       Standard  2327.092181
3  1096       Standard  1280.030541
4  1541  New Promotion  1513.563200

In [9]:
credit_promo_standard = credit_promo.loc[credit_promo['insert'] == 'Standard', 'dollars']
credit_promo_promotion = credit_promo.loc[credit_promo['insert'] == 'New Promotion', 'dollars']

In [10]:
print('Mean spend of Standard ad receivers :', credit_promo_standard.mean(), '| Mean spend of Promotion ad receivers :', credit_promo_promotion.mean())

Mean spend of Standard ad receivers : 1566.3890309659348 | Mean spend of Promotion ad receivers : 1637.4999830647992

### Ho : Spend of promotion as receivers = Spend of standard ad receivers
### Ha : Spend of promotion ad receivers > Spend of standard ad receivers
### CI : 95%, p-value : 0.05
### Independent Sample t-test

In [11]:
stats.ttest_ind(credit_promo_standard, credit_promo_promotion)

Ttest_indResult(statistic=-2.2604227264649963, pvalue=0.024225996894147814)

### Conclusion :
Since p-value is coming out to be very low(<0.05), we can reject the null hypothesis.

In other words, we can say that the promotion has helped increase the sales

## Q3. 
An experiment is conducted to study the hybrid seed production of bottle gourd under open field conditions. The main aim of the investigation is to compare natural pollination and hand pollination. The data are collected on 10 randomly selected plants from each of natural pollination and hand pollination. The data are collected on fruit weight (kg), seed yield/plant (g) and seedling length (cm).(pollination.csv)

In [12]:
pollination = pd.read_csv(path + 'pollination.csv')
pollination

      Group  Fruit_Wt  Seed_Yield_Plant  Seedling_length
0   Natural      1.85            147.70            16.86
1   Natural      1.86            136.86            16.77
2   Natural      1.83            149.97            16.35
3   Natural      1.89            172.33            18.26
4   Natural      1.80            144.46            17.90
5   Natural      1.88            138.30            16.95
6   Natural      1.89            150.58            18.15
7   Natural      1.79            140.99            18.86
8   Natural      1.85            140.57            18.39
9   Natural      1.84            138.33            18.58
10     Hand      2.58            224.26            18.18
11     Hand      2.74            197.50            18.07
12     Hand      2.58            230.34            19.07
13     Hand      2.62            217.05            19.00
14     Hand      2.68            233.84            18.00
15     Hand      2.56            216.52            18.49
16     Hand      2.34            211.93            17.45
17     Hand      2.67            210.37            18.97
18     Hand      2.45            199.87            19.31
19     Hand      2.44            214.30            19.36

### (a). 
Is the overall population of Seed yield/plant (g) equals to 200?

In [13]:
print('Mean of Seed Yield per plant :', pollination['Seed_Yield_Plant'].mean())

Mean of Seed Yield per plant : 180.8035

### Ho : Mean of seed yield per plant = 200
### Ha : Mean of seed yield per plant <> 200
### CI : 95%, p-value : 0.05
### One Sample t-test

In [14]:
stats.ttest_1samp(pollination['Seed_Yield_Plant'], 200)

Ttest_1sampResult(statistic=-2.3009121248548645, pvalue=0.032891040921283025)

### Conclusion :
Since p-value is coming out to be low we can reject the null hypothesis. 

In other words, we can say that the overall population of seed yield plant != 200.

### (b). 
Test whether the natural pollination and hand pollination under open field conditions are equally effective or are significantly different.

In [15]:
pollination_natural = pollination[pollination['Group'] == 'Natural']
pollination_hand = pollination[pollination['Group'] == 'Hand']

In [16]:
print('Mean for Natural Pollination')
print('Mean of Fruit Weight :', pollination_natural['Fruit_Wt'].mean(), 
      '| Mean of Seed Yield per plant :', pollination_natural['Seed_Yield_Plant'].mean(),
      '| Mean of Seed Length :', round(pollination_natural['Seedling_length'].mean(), 3))

print('\n')

print('Mean for Hand Pollination')
print('Mean of Fruit Weight :', round(pollination_hand['Fruit_Wt'].mean(), 3), 
      '| Mean of Seed Yield per plant :', pollination_hand['Seed_Yield_Plant'].mean(),
      '| Mean of Seed Length :', round(pollination_hand['Seedling_length'].mean(), 3))

Mean for Natural Pollination
Mean of Fruit Weight : 1.848 | Mean of Seed Yield per plant : 146.009 | Mean of Seed Length : 17.707


Mean for Hand Pollination
Mean of Fruit Weight : 2.566 | Mean of Seed Yield per plant : 215.598 | Mean of Seed Length : 18.59

### Ho : Natural Pollination and Hand Pollination are equally effective under open field condition.
### Ha : Natural Pollination and Hand Pollination are different under open field condition.
### CI : 95%, p-value - 0.05
### Independent Sample t-test

In [17]:
stats.ttest_ind(pollination_natural['Fruit_Wt'], pollination_hand['Fruit_Wt'])

Ttest_indResult(statistic=-17.669989614440286, pvalue=8.078362076486221e-13)

In [18]:
stats.ttest_ind(pollination_natural['Seed_Yield_Plant'], pollination_hand['Seed_Yield_Plant'])

Ttest_indResult(statistic=-13.958260515902547, pvalue=4.2714815854843853e-11)

In [19]:
stats.ttest_ind(pollination_natural['Seedling_length'], pollination_hand['Seedling_length'])

Ttest_indResult(statistic=-2.542229999657055, pvalue=0.020428817064110226)

### Conclusion :
Since the p-value for all the three measures is coming out to be low(<0.05), we can reject the null hypothesis.

In other words, we can say that natural pollination and hand pollination are significantly different under open field conditions.

## Q4. 
An electronics firm is developing a new DVD player in response to customer requests. Using a prototype, the marketing team has collected focus data for different age groups viz. Under 25; 25-34; 35-44; 45-54; 55-64; 65 and above. Do you think that consumers of various ages rated the design differently?(dvdplayer.csv)

In [20]:
dvdplayer = pd.read_csv(path + 'dvdplayer.csv')
dvdplayer.head()

      agegroup   dvdscore
0  65 and over  38.454803
1        55-64  17.669677
2  65 and over  31.704307
3  65 and over  25.924460
4     Under 25  30.450007

In [21]:
dvdplayer.agegroup.unique()

array(['65 and over', '55-64', 'Under 25', '25-34', '45-54', '35-44'],
      dtype=object)

In [22]:
dvdplayer_65andabove = dvdplayer.loc[dvdplayer['agegroup'] == '65 and over', 'dvdscore']
dvdplayer_55_64 = dvdplayer.loc[dvdplayer['agegroup'] == '55-64', 'dvdscore']
dvdplayer_45_54 = dvdplayer.loc[dvdplayer['agegroup'] == '45-54', 'dvdscore']
dvdplayer_35_44 = dvdplayer.loc[dvdplayer['agegroup'] == '35-44', 'dvdscore']
dvdplayer_25_34 = dvdplayer.loc[dvdplayer['agegroup'] == '25-34', 'dvdscore']
dvdplayer_under25 = dvdplayer.loc[dvdplayer['agegroup'] == 'Under 25', 'dvdscore']

In [23]:
print('Mean score of 65 and above :', round(dvdplayer_65andabove.mean(), 3), 
      '\nMean score of 55-64 :', round(dvdplayer_55_64.mean(), 3), 
      '\nMean score of 45-54 :', round(dvdplayer_45_54.mean(), 3), 
      '\nMean score of 35-44 :', round(dvdplayer_35_44.mean(), 3), 
      '\nMean score of 25-34 :', round(dvdplayer_25_34.mean(), 3),
      '\nMean score of under 25 :', round(dvdplayer_under25.mean(), 3))

Mean score of 65 and above : 28.003
Mean score of 55-64 : 28.447
Mean score of 45-54 : 39.118
Mean score of 35-44 : 37.018
Mean score of 25-34 : 31.678
Mean score of under 25 : 28.749

In [24]:
stats.f_oneway(dvdplayer_65andabove, dvdplayer_55_64, dvdplayer_45_54, dvdplayer_35_44, dvdplayer_25_34, dvdplayer_under25)

F_onewayResult(statistic=6.992526962676514, pvalue=3.087324905679639e-05)

### Conclusion :
Since p-value is coming out to be very low(<0.05), we reject the null hypothesis.

In other words, we can say that people from different age groups have rated the design differently.

## Q5. 
A survey was conducted among 2800 customers on several demographic characteristics. Working status, sex, age, age-group, race, happiness, no. of child, marital status, educational qualifications, income group etc. had been captured for that purpose.(sample_survey.csv)

In [25]:
sample_survey = pd.read_csv(path + 'sample_survey.csv')
sample_survey.head()

,id,wrkstat,marital,childs,age,educ,paeduc,maeduc,speduc,degree,...,agecat,childcat,news1,news2,news3,news4,news5,car1,car2,car3
0,1,Working full time,Divorced,2.0,60.0,12.0,12.0,12.0,NaN,High school,...,55 to 64,1-2,No,No,No,No,No,American,Japanese,Japanese
1,2,Working part-time,Never married,0.0,27.0,17.0,20.0,NaN,NaN,Junior college,...,25 to 34,None,No,No,Yes,No,No,American,German,Japanese
2,3,Working full time,Married,2.0,36.0,12.0,12.0,12.0,16.0,High school,...,35 to 44,1-2,No,No,No,Yes,Yes,American,American,NaN
3,4,Working full time,Never married,0.0,21.0,13.0,NaN,12.0,NaN,High school,...,Less than 25,None,No,No,No,Yes,Yes,American,Other,NaN
4,5,Working full time,Never married,0.0,35.0,16.0,NaN,12.0,NaN,Bachelor,...,35 to 44,None,No,No,No,No,No,American,American,Korean

### (a).
Is there any relationship in between labour force status with marital status?

In [26]:
obs_a = pd.crosstab(sample_survey.wrkstat, sample_survey.marital)
obs_a

marital                  Divorced  Married  Never married  Separated  Widowed
wrkstat
Keeping house                  25      200             35         13       55
Other                          12       16             14          4        8
Retired                        53      168             17          6      150
School                          7        9             60          2        1
Temporarily not working         9       23             11          1        2
Unemployed, laid off           10       13             32          0        3
Working full time             295      778            392         58       44
Working part-time              35      138            102          9       20

### Ho : There is no relationship between labour force status and marital status
### Ha : There is a relationship between labour force status and marital status
### CI : 95%, p-value : 0.05
### chi-square test

In [27]:
stats.chi2_contingency(obs_a)[:3]

(729.2421426572284, 1.4875268409067568e-135, 28)

### Conclusion : 
Since p-value is coming out to be very low (<0.05), we an reject the null hypothesis.

In other words, we can say that there is a relationship between labour force status and maital status.

### (b). 
Do you think educational qualification is somehow controlling the marital status?

In [28]:
obs_b = pd.crosstab(sample_survey.educ, sample_survey.marital)
obs_b

marital  Divorced  Married  Never married  Separated  Widowed
educ
0.0             0        1              1          0        0
2.0             0        1              1          0        3
3.0             2        3              2          1        2
4.0             2        2              1          0        4
5.0             2        3              0          0        3
6.0             2       12              2          1        6
7.0             6       11              0          0        4
8.0             9       36              8          2       27
9.0            18       28              9          4       16
10.0           26       48             21          3       15
11.0           25       50             40          6       17
12.0          125      415            180         33       98
13.0           48      118             71         16       17
14.0           62      168             89          9       21
15.0           26       56             48          3       13
16.0           47      214            116         10       25
17.0           13       46             24          2        1
18.0           12       66             24          1        6
19.0            9       21              8          1        2
20.0           10       40             15          1        3

### Ho : There is no relationship between educational qualification and marital status.
### Ha : There is a relationship between educational qualification and marital status.
### CI : 95%, p-value : 0.05
### chi-square test

In [29]:
stats.chi2_contingency(obs_b)[:3]

(221.10896441647762, 4.3102883499745113e-16, 76)

### Conclusion :
Since p-value is coming out to be very low, we can reject the null hypothesis.

In other words, we can say that there is a relationship between educational qualification and marital status.

### (c). 
Is happiness is driven by earnings or marital status?

In [30]:
obs_c1 = pd.crosstab(sample_survey.happy, sample_survey.income)
obs_c1

income,$1000 TO 2999,$10000 - 14999,$15000 - 19999,$20000 - 24999,$25000 or more,$3000 TO 3999,$4000 TO 4999,$5000 TO 5999,$6000 TO 6999,$7000 TO 7999,$8000 TO 9999,LT $1000
happy,,,,,,,,,,,,
Not too happy,7,39,33,40,113,9,9,6,14,12,9,11
Pretty happy,20,107,119,155,888,11,13,18,13,21,30,13
Very happy,5,44,26,50,571,4,10,11,6,14,19,11

### Ho : There is no relationship between happiness level and the income of a person
### Ha : There is a relationship between happiness level and the income of a person
### CI : 95%, p-value : 0.05
### chi-square test

In [31]:
stats.chi2_contingency(obs_c1)[:3]

(178.9505306121643, 1.4107677273473057e-26, 22)

### Ho : There is no relationship between happiness level and the marital status of a person
### Ha : There is a relationship between happiness level and the marital status of a person
### CI : 95%, p-value : 0.05
### chi-square test

In [35]:
obs_c2 = pd.crosstab(sample_survey.happy, sample_survey.marital)
obs_c2

marital        Divorced  Married  Never married  Separated  Widowed
happy
Not too happy        72       71            108         30       59
Pretty happy        278      684            426         49      137
Very happy           93      582            120         13       83

In [36]:
stats.chi2_contingency(obs_c2)[:3]

(260.6894389418282, 9.3147261197964e-52, 8)

### Conclusion :
Since the p-value for both the tests i.e happiness level with income and marital status of a person, is less than 0.05 we can say that both the variables have a role to play in determining the happiness of a person, but since the p-value for marital status is coming out to be lower than the p-value of income level we can say that marital status is a more significant variable in determining the happiness of a person.